
####################################### all curent phrases that invoke commands ######################################

start = ("козак", "привіт", "привіт козак", "привіт хлопче", "здоров мужик", "привід")
question1 = ("хто ти", "що ти таке")
question2 = ("що ти можеш", "що ти вмієш", "які в тебе є можливості")
msg = ("відправ повідомлення", "відправ повідомленні", "напиши повідомлення", "напиши повідомленні", "відправити")
msg_how = ("телеграм ", "телеграмма ", "телеграму")
wikipedia = ("розкажи про ", "що таке ", "хто такий ", "хто така ")
end = ("досить", "засни")
joke = ("розкажи анекдот", "насміши мене", "ти знаєш анекдоти", "давай інший", "давайте інший")
music = ("хочу слухати музику", "увімкни музику", "музон", "дай драйву", "хочу танцювати")
time = ("котра година", "як пізно зараз", "підскажи час")
open_something = ("відкрий ", "запустити ", "відкрив ", "відкриє ", "хочу переглянути", "відкрити")
weather = ("погода", "скажи погоду", "яка погода", "як там надворі")

################################# a dictionary that helps to execute "open_smt" function ##############################

apps = {"app": {
            "браузер": "C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe",
            "телеграм": "D:\\Telegram Desktop\\Telegram.exe",
            "калькулятор": "calc"
                },
        "website": {
            "пошту": "https://mail.google.com/mail/u/0/?hl=de#inbox",
            "відео": "https://www.youtube.com/"
                    }}

####################################### a small selection of jokes ####################################################

jokes_db = ('-Яка різниці між москалем та цибулею?- Коли ріжеш цибулю - плачеш.',
            'Німий півень зранку вібрує',
            'Клаустрофобна особа, надягаючи светр, деякий час репетує.',
            '- Тато, а з чого зроблені хмари? - Сервера, здебільшого, під лінуксом ...',
            'Справжні математики прокидаються вночі о третій годині чотирнадцять хвилин, щоб сходити ПІ-ПІ',
            'Бібліотекарка чхнула, і її шмаркля потрапила до книги рекордів Гіннеса.',
            'Тільки програміст без докорів сумління може сказати своїй другій дівчині, що вона у нього перша ...',
            'Найбільша студентська брехня: "Перелік використаної літератури".',
            'Голодніше студента може бути тільки студент, у якого ще й дівчина є ...',
            'Горілка - ворог студента, але ... студент ворогів не боїться!')
